#------------------Задача 1--------------------------#
# даны 3 числа, распечатать в порядке возрастания.
# a = int(input('5'))
# b = int(input('4'))
# c = int(input('3'))
# if a < b:
#     a, b = b, a
# if b < c:
#     b, c = c, b
# if a < b:
#     a, b = b, a
# print(a, b, c)






#------------------Задача 4--------------------------#
# Пользователь с клавиатуры вводит количество часов.
# Если полученное значение находится в диапазоне от 0 до 5 нужно вывести надпись Good Night,
# если в диапазоне от 5 до 12 Good Morning,
# если в диапазоне от 12 до 17 Good Day,
# если в диапазоне от 17 до 22 Good Evening,
# если в диапазоне от 22 до 24 Good Night

# time = float(input("Введите текущее время, час"))
# if time >= 0 and time <5:
#     print("Good Night")
# elif time >= 5 and time <= 12:
#     print("Good Morning")
