#-----------------------------------Задание-------------------------------------#
"""
У отца два ребенка.
Он решил сводить детей в KFC, но сначала планирует
"""
# child1_answer = False_# да - True   |      нет - False
# child2_answer = False_# да - True   |      нет - False
#
# if child1_answer

# -----------------------------------Задание-------------------------------------#
# 1 <= num <= 12 -> преобразовать в логическое выражение
num = 0
# if 1 <= num and num <= 12: # num >= 1 and num <= 12
#     print("месяц существует")
# else:
#     print("нет месяца")


# -----------------------------------Задание-------------------------------------#
# Напишите программу
# Пользователю предлагается выбрать фигуру (квадрат или треугольник) и цвета
# from turtle import*
# from time import *
# figure = "квадрат"
# color_shape = "1"
# if figure == "квадрат" and color_shape == "1":
#     color("red")
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#     sleep(5)
# if figure == "треугольник" and color_shape == "2":
#     color("red")
#     forward(100)
#     left(120)
#     forward(100)
#     left(120)
#     forward(100)
#     left(120)

#--------------еще один вариант решения------------------------------------------------#
# if figure == "квадрат":
#     if color_shape == "1":
#         color("red")
#     if color_shape == "2":
#         color("blue")
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#     forward(100)
#     left(90)
#
# sleep(5)

#----------------------Задание------------------------------------------#
# Выяснить делится число на 5 и на 3
# num = 10 # input()
# if num % 5 == 0 and num % 3 == 0:
#     print(f"{num} делится число на 5 и на 3")
# else:
#     print(f"{num} не делится (одновременно) число на 5 и на 3")


#----------------------Задание------------------------------------------#
# Посчитать площадь прямоугольника (дается две стороны)
# a = 5 #input() # длина стороны
# b = 3 #input() # длина стороны
# if a >= 0 and b > 0:
#     s = a*b
#     print(f"s={s}")


#----------------------Задание------------------------------------------#
#  программа кошелек
# (статус("активный", "заблокирован"), баланс >= 0), снятие, пополнение, просмотр баланса

status = "активный"# input()
balance = 100# input()


if status == "активный":
    # pass_# код потом допишется
    if balance == 0:
        print("доступны такие операции: пополнение, просмотр баланса")

    if balance > 0:
        print("доступны такие операции: снятие, пополнение, просмотр баланса")
    type_of_operation = "снятие"
    if type_of_operation == "пополнение":
        money = 100  # input()
        balance = balance + money

    if type_of_operation == "просмотр баланса":
        print(f"ваш баланс = {balance}")

    if type_of_operation == "снятие":
        money = 100  # input()
        if money <= balance:
            balance = balance - money
        else:
            print("недостаточно средств")

else:
    print("ваш кошелек заблокирован")
