# задача 1
# Пользователь вводит сумму вклада в банк и годовой процент. Найдите сумму вклада через 5 лет
x = 100
y = 25
s1 = x/100 * y + x
s2 = s1/100 * y +s1
s3 = s2/100 * y +s2
s4 = s3/100 * y +s3
s5 = s4/100 * y +s4

print(s5)
