#----------------------Задача 1--------------------------------#
# Дано: температура в цельсиях(число) и давление в паскалях (число)
# Написать замерзнет вода или нет
# Вода замерзает при выполнения двух условий:
#   1. давление в 10^5 Паскаль
#   2. температура меньше либо равно 0 градусов по цельсию

# t = float(input("Введите температуру в Цельсиях"))
#
# p = float(input("Введите давление в Паскалях"))
#
# if t <= 0:
#     bool(1)
# if p == (10 ** 5):
#     bool(2)
#     a = bool(1) and bool(2)
#     b = print("Вода замерзнет")
# else:
#     b = bool(0)
#     b = print("Вода не замерзнет")


#----------------------Задача 3-------------------------------#
# Дано два числа.
# Найдите наибольшее четное число среди них
# Если оно не существует, выведите фразу "not found"

# a = int(input("Число 1"))
# b = int(input("Число 2"))
# if a > b:
#     if a%2==0:
#         print(a)
#     elif b%2==0:
#         print(b)
# elif b > a:
#     if a % 2 == 0:
#         print(a)
#     elif b % 2 == 0:
#         print(b)
# else:
#     if a%2==0:
#         print(a)
#     else:
#         print("not found")
