# ----------------задача---------------------#
# Найдите количество различных элементов данного массива.


numbers = [2,3,2,2,6,8,9,10]

unique_numbers = set(numbers)
print(unique_numbers)
print(len(unique_numbers))