#-------------Задача-----------------#
# Дано:
# ●	3 стороны треугольника
# Проверить существует ли треугольник

# print("Стороны:")
# a = float(input("a = "))
# b = float(input("b = "))
# c = float(input("c = "))
#
# if a + b > c and a + c > b and b + c > a:
#     print("Треугольник существует")
# else:
#     print("Треугольник не существует")

#-------------------------ЗАДАЧА ПОИСК ОШИБОК-----------------------------#
# калькулятор
# доступны операции умножить и поделить
num1 = 5
operation = '*'
num2 = 6
if operation == '*':
    print(num1*num2)
if operation == '/':
    print(num1/num2)
else:
    print("нет такой операции")
