#-------------------задача---------------------------#
# Выведите столбец чисел от 1 до 100, используя цикл while
#
# start = 1
# end = 100
# while start <= end:
#     print(start, end= '\n')
#     start += 1

#------------------------задача---------------------------#
# Дана пицца 16 кусочков. Доступны команды:
# 1.print(‘Взять кусок’)
# 2. print(‘съесть кусок’)
# 3. print(‘положить кусок обратно’)
# написать программу, симулующую поедание кусочков пиццы,
# в  программе обязательно должно присутствовать команда №3 два раза.
# Проверять условием, если пиццы в руках нет.

# n = 16 # кол-во кусков пиццы
# while n != 0:
#     print("Взять кусок")
#     print("положить кусок обратно")
#     print("съесть кусок, end= '\n'")
#     n -= 1  # n = n - 1

